attacker/data/sio+scaling/spoofing/ab_results/ab_65.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   125.088 seconds
Complete requests:      20
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Keep-Alive requests:    19
Total transferred:      4594 bytes
HTML transferred:       1763 bytes
Requests per second:    0.16 [#/sec] (mean)
Time per request:       62544.162 [ms] (mean)
Time per request:       6254.416 [ms] (mean, across all concurrent requests)
Transfer rate:          0.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   4.4      5      12
Processing:   217 42092 52570.9   3499  120110
Waiting:      216 36252 49865.6   3498  114184
Total:        225 42096 52567.6   3507  120110

Percentage of the requests served within a certain time (ms)
  50%   3507
  66%  103178
  75%  110002
  80%  112768
  90%  114184
  95%  120110
  98%  120110
  99%  120110
 100%  120110 (longest request)
